'''Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов. 
Пример: для k = 8 список будет выглядеть так: 
[-21 ,13, -8, 5, -3, 2, -1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] Негафибоначчи'''

num = int(input('Введите размер списка Фибоначчи: '))
if num < 0: num = num*-1
n1 = n2 = 1
list1 = [n1, n2]
for i in range(2, num):
    n1,n2 = n2, n1 + n2
    list1.append(n2)
print(list1)
n1=n2=1
for i in range(-num, 1):
    n1,n2 = n2, n1 - n2
    list1.insert(0, n2)
print(list1)
